# BuiltInFailures.KeynoteFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeynoteFailures Class
BuiltInFailures Class Members See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class KeynoteFailures
```

Visual Basic
---
```text
Public NotInheritable Class KeynoteFailures
```

Visual C++
---
```text
public ref class KeynoteFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..KeynoteFailures
# See Also
BuiltInFailures..::..KeynoteFailures Members
Autodesk.Revit.DB Namespace